Revit 2024 API
AssetPropertyDoubleArray3d.GetValueAsXYZ Method
 Get the value property as a vector or point XYZ.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ GetValueAsXYZ()
Visual Basic
Public Function GetValueAsXYZ As XYZ
Visual C++
public:
XYZ^ GetValueAsXYZ()
See Also
AssetPropertyDoubleArray3d Class
Autodesk.Revit.DB.Visual Namespace